package weather

// IconMap mapping weather ID to emoji icon.
// Based on this https://openweathermap.org/weather-conditions
// NOTE ATTENTION the map is fully populated, but the emojis may not be visible in all editors!
var IconMap = map[int]string{
	200: "⛈️",
	201: "⛈️",
	202: "⛈️",
	210: "🌩️",
	211: "🌩️",
	212: "🌩️🌩️",
	221: "🌩️",
	230: "⛈️",
	231: "⛈️",
	232: "⛈️",

	300: "🌧️",
	301: "🌧️",
	302: "🌧️🌧️",
	310: "🌧️",
	311: "🌧️",
	312: "🌧️",
	313: "🌧️",
	314: "🌧️",
	321: "🌧️",

	500: "🌧️",
	501: "🌧️",
	502: "🌧️🌧️",
	503: "🌧️🌧️",
	504: "🌧️🌧️🌧️",
	511: "🌧️🧊",
	520: "🌧️",
	521: "🌧️",
	522: "🌧️🌧️",
	531: "🌧️",

	600: "🌨️",
	601: "🌨️",
	602: "🌨️🌨️",
	611: "🌨️🌧️",
	612: "🌨️🌧️",
	613: "🌨️🌧️",
	615: "🌨️🌧️",
	616: "🌨️🌧️",
	620: "🌨️",
	621: "🌨️",
	622: "🌨️",

	701: "🌫️",
	711: "🌫️",
	721: "🌫️",
	731: "🌫️",
	741: "🌫️",
	751: "🌫️",
	761: "🌫️",
	762: "🌋",
	771: "💨",
	781: "🌪️",

	800: "☀️",

	801: "⛅",
	802: "⛅☁️",
	803: "☁️",
	804: "☁️",
}
